//  Домашка №1

alert ("Не выводи меня пожалуйста");
let name = "Ayub";
let LastName = "Gadiev";
console.log(name,LastName);

/* неправильное название переменной 
let 1Ayub = 1  нет точки с запятой и начинается с цифры
*/


//Домашка №2 

let notice = "Я же просил";
notice = "Не пожожда, опутите"; //Переопределение переменной
alert(notice);

const numb = 10; 
// numb = 12; нет смысла пытаться изменить numb
if (numb <=10){
    console.log("Константа меньше 10")
}
else{
    console.log("Константа не меньше 10")
}
/*
- Какой тип данных нужно использовать, чтобы задать дату формата 28.02.1999?
- Какой тип данных нужен для сохранения числа ПИ 3.14?

Ответы:

Для даты можно использовать тип данных number 

Для числа ПИ можно использовать number но в конце добавить n
*/

let Cash = 1500; //общая сумма в рублях
let dollar = 77; //соотношение к 1 доллару рубли
let result = Cash/dollar; //Делим наши рубли на стоимость 1 доллара.
console.log(`Вы можете купить ${Math.floor (result)} долларов`);
