/* Домашка 3

Задание 1.
 Создать объект man с информацией о человеке 
(имя, фамилия, возраст, рост, логин, пароль, сумма денег на счете)
*/

let man = 
{
    name: "Ayub",
    lastname: "Gadiev",
    age: 22,
    height: 183,
    login: "Ayub_Black",
    password: "Chechnya",
    cash: "50$"
};

/* Задание 2.
- Создать переменную и присвоить ей любое текстовое значение. 
Написать условие, по которому проверяется соответствует ли значение этой переменной 
паролю человека. Если соответствует,
то вывести в консоль “Добро пожаловать, [имя фамилия].  Ваш логин [логин]". 
Иначе вывести "Указанный пароль [пароль из переменной] не верен. Попробуйте еще раз".
*/

let a = "Chechnya";

if (a == man.password)
{
    console.log(`Добро пожаловать ${man.name} ${man.lastname}. Ваш логин ${man.login}.`);
}
else
{
    console.log(`Указанный пароль ${a} не верен. Попробуйте еще раз.`);
}